//定义敏感字符
function mgc(sum){
    var words=['天安门事件','习近平','平近习','习太子','习明泽','李克强','江泽民','江蛤蟆','江贼民','李鹏','江胡内斗','月月鸟','八九六','共产专制','宇宙最高法理','洪发交流','绝食抗暴','圆明网','弘法体','五套功法','流氓无产者','九评共产党','中共走狗','中共小丑','退党','慧网','明慧','大纪元','李洪志','新唐人','fuck','法轮功','法轮大法好','姐兼职','姐包夜','肛交','G点','G点高潮','屄','插穴','戳穴','大穴','发骚','肥穴','狠插','狠干','奸尸','奸淫','精水','口交','狂抽','狂干','轮奸','肏','媚唇','嫩穴','骚B','骚货','骚劲','骚浪','骚女','骚水','骚淫','舔穴','舔阴','穴痒','阳萎','阴洞','阴阜','阴垢','阴穴','阴液','淫棒','淫唇','淫荡','淫洞','淫妇','淫哥','淫花','淫火','淫溅','淫叫','淫津','淫精','淫具','淫浪','淫乱','淫毛','淫媚','淫靡','淫糜','淫母','淫念','淫女','淫虐','淫腔','淫情','淫人','淫肉','淫乳','淫骚','淫色','淫舌','淫神','淫水','淫汤','淫娃','淫物','淫香','淫邪','淫心','淫兴','淫性','淫嗅味','淫穴','淫血','淫痒','淫液','淫逸','淫友','淫欲','淫汁','淫挚','淫纵','淫狎','淫猥','玉背','玉茎','玉穴','玉液','shit','法伦','大纪元','fuck ','明慧网','乱交','嫖娼','草你','干妳娘','干你妈B','干你妈b','干你娘','干他妈','操她','骑他','骑她','欠骑','欠人骑','来爽我','来插我','机叭','爽你','欠干','奸你','奸他','奸她','叼你','64事件','六四学潮','六四屠杀','64运动','89事件','姦染','淫告白','乳射','朝天穴','女屄','慰春情','淫B','屄屄','肛屄','舔B','嫩奶','a4y','品穴','堕淫','胸濤乳浪','黑屄','奶大屄肥','拔屄','穴海','换妻杂交','粉屄','口射','奶挺臀翘','扒屄','痴乳','鬼輪姦','浴尿','淫样','発妻','姫辱','插后庭','嫩缝','骚妈','激插','母子交欢','嫐屄','足脚交','露屄','柔阴术','相奸','淫师荡母','桃园蜜洞','二穴中出','奴畜抄','连続失禁','玩穴','性交自拍','叫鸡','骚浪人妻','潮吹','退黨','亡党'];
    for(var i=0;i<words.length;i++){
        sum = sum.replace(new RegExp(words[i],'ig'),new Array(words[i].length + 1).join('*'));
    };
    return sum;
}